app/controllers/histories_controller.rb

SELECT "histories".* FROM "histories"
---
  def index
    @histories = History.all

SELECT "histories".* FROM "histories" WHERE "histories"."user_id" = ?  [["user_id", 4]]
---
  def u_histories
    @histories = History.where user_id: helpers.current_user.id

INSERT INTO "histories" ("title", "picture", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "nlce"], ["picture", nil], ["content", "zsxsx"], ["created_at", "2018-09-24 23:51:30.858062"], ["updated_at", "2018-09-24 23:51:30.858062"], ["user_id", 4]]
---
  def create
    @history = History.new(history_params)
    @history.user = helpers.current_user

    respond_to do |format|
      if @history.save

SELECT  "histories".* FROM "histories" WHERE "histories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_history
      @history = History.find(params[:id])