app/controllers/users_controller.rb

def create
  @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "hola"], ["email", "hola@hola.com"], ["password", "hola"], ["created_at", "2018-09-24 22:52:29.648452"], ["updated_at", "2018-09-24 22:52:29.648452"]]